In [11]:
import pandas as pd
import numpy as np
data2 = pd.read_csv("..//raw//CPI_data.csv",header=None) #relative path represented as ..
data2.columns=['Date2','CPI']
print(data2.columns)

Index(['Date2', 'CPI'], dtype='object')

In [4]:
#removed the uncessary 0th index row
data2=data2.drop(index=[0])
data2

          Date2      CPI
1    1947-01-01   21.480
2    1947-02-01   21.620
3    1947-03-01   22.000
4    1947-04-01   22.000
5    1947-05-01   21.950
..          ...      ...
931  2024-07-01  313.534
932  2024-08-01  314.121
933  2024-09-01  314.686
934  2024-10-01  315.454
935  2024-11-01  316.441

[935 rows x 2 columns]

In [6]:
data2['Date2'] = pd.to_datetime(data2['Date2'], format='%Y-%m-%d',errors='coerce')
data2['CPI']=pd.to_numeric(data2['CPI'],errors='coerce') 
data2=data2.dropna(subset=['Date2'])  #drop rows with invalid data
data2

         Date2      CPI
1   1947-01-01   21.480
2   1947-02-01   21.620
3   1947-03-01   22.000
4   1947-04-01   22.000
5   1947-05-01   21.950
..         ...      ...
931 2024-07-01  313.534
932 2024-08-01  314.121
933 2024-09-01  314.686
934 2024-10-01  315.454
935 2024-11-01  316.441

[935 rows x 2 columns]

In [7]:
data2.set_index('Date2',inplace=True) 
quarterly2=data2.resample('QE').mean() 
quarterly2.reset_index(inplace=True)  
print(quarterly2)

         Date2         CPI
0   1947-03-31   21.700000
1   1947-06-30   22.010000
2   1947-09-30   22.490000
3   1947-12-31   23.126667
4   1948-03-31   23.616667
..         ...         ...
307 2023-12-31  308.099000
308 2024-03-31  310.989667
309 2024-06-30  313.160333
310 2024-09-30  314.113667
311 2024-12-31  315.947500

[312 rows x 2 columns]

In [8]:
quarterly2.to_csv("CPI_quarterly.csv", index=False)

In [9]:
quarterly2

         Date2         CPI
0   1947-03-31   21.700000
1   1947-06-30   22.010000
2   1947-09-30   22.490000
3   1947-12-31   23.126667
4   1948-03-31   23.616667
..         ...         ...
307 2023-12-31  308.099000
308 2024-03-31  310.989667
309 2024-06-30  313.160333
310 2024-09-30  314.113667
311 2024-12-31  315.947500

[312 rows x 2 columns]